package com.rohitjakhar.panchangdate

object Utils {
    val month = listOf(
        "January", "February", "March", "April", "May", "June",
        "July", "August", "September", "October", "November", "December"
    )

    val rashi = listOf(
        "मेष", "वृष", "मिथुन", "कर्क", "सिंह", "कन्या", "तुला",
        "वृश्चिक", "धनु", "मकर", "कुंभ", "मीन"
    )

    val day = listOf("Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday")

    val tithi = listOf(
        "प्रतिपदा", "द्वितीया", "तृतीया", "चतुर्थी", "पंचमी",
        "षष्ठी", "सप्तमी", "अष्टमी", "नवमी", "दशमी", "एकादशी",
        "द्वादशी", "त्रयोदशी", "चतुर्थदशी", "पूर्णिमा", "प्रतिपदा", "द्वितीया", "तृतीया", "चतुर्थी", "पंचमी",
        "षष्ठी", "सप्तमी", "अष्टमी", "नवमी", "दशमी", "एकादशी",
        "द्वादशी", "त्रयोदशी", "चतुर्थदशी", "अमावस्या",
    )

    val karan = listOf(
        "बव", "बालव", "कौलव", "तैतिल", "गर", "वणिज",
        "विष्टि", "शकुनि", "चतुष्पाद", "नाग", "किस्तुघ्न"
    )

    val yoga = listOf(
        "विष्कुम्भ", "प्रीति", "आयुष्मान", "सौभाग्य", "शोभन",
        "अतिगण्ड", "सुकर्मा", "धृति", "शूल", "गण्ड", "वृद्धि",
        "ध्रुव", "व्याघात", "हर्षण", "वज्र", "सिद्धि", "व्यातीपात",
        "वरीयान", "परिघ", "शिव", "सिद्ध", "साध्य", "शुभ", "शुक्ल",
        "ब्रह्म", "इन्द्र", "वैधृति"
    )

    val nakshatra = listOf(
        "अश्विनी", "भरणी", "कृत्तिका", "रोहिणी", "मृगशिरा", "आद्र्रा",
        "पुनर्वशु", "पुण्य", "अश्लेषा", "मघा", "पूर्वाफाल्गुनी", "उत्तरा फाल्गुनी",
        "हस्त", "चित्रा", "स्वाती", "विशाखा", "अनुराधा", "ज्येष्ठा", "मूल",
        "पूर्वाषाढ़ा", "उत्तराषाढ़ा", "श्रवणा", "घनिष्ठा", "शतभिषा",
        "पूर्वा भाद्र पद", "उत्तराभाद्रपद", "Revathi"
    )



}
